In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os,json

In [2]:
with open('/Users/carlo/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [3]:
from urllib.parse import quote_plus as urlquote
from sqlalchemy.engine import create_engine
connection = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/movies"
engine = create_engine(connection)
conn = engine.connect()

In [4]:
basics = pd.read_csv('Data/title.basics.csv')
basics.info()
basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86979 entries, 0 to 86978
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      86979 non-null  int64
 1   tconst          86979 non-null  object
 2   titleType       86979 non-null  object
 3   primaryTitle    86979 non-null  object
 4   originalTitle   86979 non-null  object
 5   isAdult         86979 non-null  int64
 6   startYear       86979 non-null  float64
 7   endYear         0 non-null      float64
 8   runtimeMinutes  86979 non-null  int64
 9   genres          86979 non-null  object
dtypes: float64(2), int64(3), object(5)
memory usage: 6.6+ MB

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,67666,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,86793,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,93930,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [5]:
basics['genres_split'] = basics['genres'].str.split(',')
basics.head(2)

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]

In [6]:
exploded_genres = basics.explode('genres_split')
exploded_genres.head(2)

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy

In [7]:
genres_split = basics['genres'].str.split(",")
unique_genres = genres_split.explode().unique()
unique_genres

array(['Comedy', 'Fantasy', 'Romance', 'Drama', 'Horror', 'Sci-Fi',
       'Biography', 'Mystery', 'Musical', 'Action', 'Adventure', 'Crime',
       'Thriller', 'Music', 'Animation', 'Family', 'History', 'War',
       'Sport', 'Western', 'Adult', 'Reality-TV', 'News', 'Talk-Show',
       'Game-Show'], dtype=object)

In [8]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [9]:
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [10]:
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [11]:
basics['genre_id'] = basics['genres_split'].replace(genre_map)
basics = basics.drop(columns='genres_split')

In [12]:
genres_lookup = pd.DataFrame({'genres_name': genre_id_map.keys(),
                             'genres_id': genre_id_map.values()})
genres_lookup.head()

  genres_name  genres_id
0      Action          0
1       Adult          1
2   Adventure          2
3   Animation          3
4   Biography          4

In [14]:
## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = genres_lookup['genres_name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "genres_name": CHAR(key_len+1), 
    "genres_id": INTEGER(),}

In [15]:
genres_lookup.to_sql('genres',conn, dtype=df_schema, if_exists='replace',index=False)

25

In [16]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genres_id`);')

In [17]:
title_genres.to_sql('title_genres',conn, if_exists='replace',index=False)

162600

In [18]:
tmdb = pd.read_csv('Data/final_tmdb_data.csv.gz')
tmdb.info()
tmdb.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11688 entries, 0 to 11687
Data columns (total 27 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Unnamed: 0             11688 non-null  int64
 1   imdb_id                11688 non-null  object
 2   adult                  11685 non-null  float64
 3   backdrop_path          7137 non-null   object
 4   belongs_to_collection  1125 non-null   object
 5   budget                 11685 non-null  float64
 6   genres                 11685 non-null  object
 7   homepage               963 non-null    object
 8   id                     11685 non-null  float64
 9   original_language      11685 non-null  object
 10  original_title         11685 non-null  object
 11  overview               11388 non-null  object
 12  popularity             11685 non-null  float64
 13  poster_path            10686 non-null  object
 14  production_companies   11685 non-null  object
 15  production_countries   11685 non-null  object
 16  release_date           11577 non-null  object
 17  revenue                11685 non-null  float64
 18  runtime                11685 non-null  float64
 19  spoken_languages       11685 non-null  object
 20  status                 11685 non-null  object
 21  tagline                5370 non-null   object
 22  title                  11685 non-null  object
 23  video                  11685 non-null  float64
 24  vote_average           11685 non-null  float64
 25  vote_count             11685 non-null  float64
 26  certification          3828 non-null   object
dtypes: float64(9), int64(1), object(17)
memory usage: 2.4+ MB

,Unnamed: 0,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1,tt0096056,0.0,/95U3MUDXu4xSCmVLtWgargRipDi.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}]",NaN,109809.0,en,...,0.0,126.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,Crime and Punishment,0.0,4.900,16.0,NaN
2,2,tt0118926,0.0,/qR3Dk3ctnrrxkAI6I472RhamIbu.jpg,NaN,0.0,"[{'id': 80, 'name': 'Crime'}, {'id': 18, 'name...",NaN,20689.0,en,...,5227348.0,132.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,"An honest man caught in a world of intrigue, p...",The Dancer Upstairs,0.0,6.093,54.0,NaN
3,3,tt0119980,0.0,NaN,NaN,0.0,"[{'id': 80, 'name': 'Crime'}, {'id': 18, 'name...",NaN,563364.0,en,...,0.0,91.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,Random Shooting in LA,0.0,0.000,0.0,NaN
4,4,tt0120679,0.0,/s04Ds4xbJU7DzeGVyamccH4LoxF.jpg,NaN,12000000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",https://www.miramax.com/movie/frida,1360.0,en,...,56298474.0,123.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Prepare to be seduced.,Frida,0.0,7.421,1928.0,R

In [19]:
tmdb = tmdb.iloc[1:]

In [20]:
tmdb = tmdb.drop(columns=['Unnamed: 0', 'adult', 'backdrop_path',
       'belongs_to_collection', 'genres', 'homepage', 'id',
       'original_language', 'original_title', 'overview', 'popularity',
       'poster_path', 'production_companies', 'production_countries',
       'release_date', 'runtime', 'spoken_languages', 'status',
       'tagline', 'title', 'video', 'vote_average', 'vote_count',])
tmdb.head()

     imdb_id      budget      revenue certification
1  tt0096056         0.0          0.0           NaN
2  tt0118926         0.0    5227348.0           NaN
3  tt0119980         0.0          0.0           NaN
4  tt0120679  12000000.0   56298474.0             R
5  tt0120804  33000000.0  103000000.0             R

In [21]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = tmdb['imdb_id'].fillna('').map(len).max()
cert_len = tmdb['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "imdb_id": CHAR(key_len+1), 
    "budget": FLOAT(),
    "revenue": FLOAT(),
    'certification':CHAR(key_len+1)}

In [22]:
# Save to sql with dtype and index=False
tmdb.to_sql('tmdb_data',conn, dtype=df_schema, if_exists='replace',index=False)

11687

In [23]:
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres
4        tmdb_data

In [24]:
q = '''DESCRIBE tmdb_data;'''
describe = pd.read_sql(q, engine)
describe

           Field      Type Null Key Default Extra
0        imdb_id  char(11)  YES        None
1         budget     float  YES        None
2        revenue     float  YES        None
3  certification  char(11)  YES        None

In [25]:
q = '''SELECT * FROM tmdb_data;'''
pd.read_sql(q, conn)

         imdb_id      budget      revenue certification
0      tt0096056         0.0          0.0          None
1      tt0118926         0.0    5227350.0          None
2      tt0119980         0.0          0.0          None
3      tt0120679  12000000.0   56298500.0             R
4      tt0120804  33000000.0  103000000.0             R
...          ...         ...          ...           ...
11682  tt6449044         0.0          0.0          None
11683  tt6694126         0.0          0.0          None
11684  tt8302928         0.0          0.0          None
11685  tt8474326         0.0          0.0          None
11686  tt8825252         0.0          0.0          None

[11687 rows x 4 columns]

In [26]:
q = '''DESCRIBE genres;'''
describe = pd.read_sql(q, engine)
describe

         Field      Type Null  Key Default Extra
0  genres_name  char(11)  YES         None
1    genres_id       int   NO  PRI    None

In [27]:
q = '''SELECT * FROM genres;'''
pd.read_sql(q, conn)

   genres_name  genres_id
0       Action          0
1        Adult          1
2    Adventure          2
3    Animation          3
4    Biography          4
5       Comedy          5
6        Crime          6
7        Drama          7
8       Family          8
9      Fantasy          9
10   Game-Show         10
11     History         11
12      Horror         12
13       Music         13
14     Musical         14
15     Mystery         15
16        News         16
17  Reality-TV         17
18     Romance         18
19      Sci-Fi         19
20       Sport         20
21   Talk-Show         21
22    Thriller         22
23         War         23
24     Western         24

In [28]:
q = '''DESCRIBE title_genres;'''
describe = pd.read_sql(q, engine)
describe

          Field  Type Null Key Default Extra
0        tconst  text  YES        None
1  genres_split  text  YES        None

In [29]:
q = '''SELECT * FROM title_genres;'''
pd.read_sql(q, conn)

           tconst genres_split
0       tt0035423       Comedy
1       tt0035423      Fantasy
2       tt0035423      Romance
3       tt0062336        Drama
4       tt0069049        Drama
...           ...          ...
162595  tt9916190       Action
162596  tt9916190    Adventure
162597  tt9916190     Thriller
162598  tt9916362        Drama
162599  tt9916362      History

[162600 rows x 2 columns]